<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"8a693ca6b13588703ff0bd4cb3d4ca94174339657beef4ff3fd58036769f41fa","plan_job_ref":"Job PR Plan #12 at https://github.com/JunzhongLin/johndemo3/actions/runs/13034648865","plan_out_hash":"0bf7edffa4465a0bd4fc2b273e3c92ffe7a6b4dfede6779d8d9291d51b5e0cbe","plan_hash":"5558b2f0a7a14fff2e1b56e0fc3606bbdd68319f2bf45b948ce0ccb3fd66442d","plan_text_format":"diff","version":"1.46.1"} -->
Terraform plan in __terraform__
With backend config files: `terraform/conf/dev.backend.conf`
With var files: `terraform/variables/common.tfvars
terraform/variables/dev.tfvars
`
<details>
<summary>Plan: 3 to add, 0 to change, 4 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # module.event_grid.azurerm_eventgrid_topic.image_queue will be destroyed
  # (because azurerm_eventgrid_topic.image_queue is not in configuration)
-   resource "azurerm_eventgrid_topic" "image_queue" {
-       endpoint                      = "https://topic-johndemo3-dev.northeurope-1.eventgrid.azure.net/api/events" -> null
-       id                            = "/subscriptions/bd4b7a52-3576-4e08-81b6-fdbe7146cb7f/resourceGroups/coop-demo3-rg-dev/providers/Microsoft.EventGrid/topics/topic-johndemo3-dev" -> null
-       input_schema                  = "EventGridSchema" -> null
-       local_auth_enabled            = true -> null
-       location                      = "northeurope" -> null
-       name                          = "topic-johndemo3-dev" -> null
-       primary_access_key            = (sensitive value) -> null
-       public_network_access_enabled = true -> null
-       resource_group_name           = "coop-demo3-rg-dev" -> null
-       secondary_access_key          = (sensitive value) -> null
    }

  # module.function.azurerm_application_insights.logging will be destroyed
  # (because azurerm_application_insights.logging is not in configuration)
-   resource "azurerm_application_insights" "logging" {
-       app_id                                = "a990b563-5580-4304-8d7a-dce1e3f63387" -> null
-       application_type                      = "web" -> null
-       connection_string                     = (sensitive value) -> null
-       daily_data_cap_in_gb                  = 100 -> null
-       daily_data_cap_notifications_disabled = false -> null
-       disable_ip_masking                    = false -> null
-       force_customer_storage_for_profiler   = false -> null
-       id                                    = "/subscriptions/bd4b7a52-3576-4e08-81b6-fdbe7146cb7f/resourceGroups/coop-demo3-rg-dev/providers/Microsoft.Insights/components/logging-function-johndemo3-dev-johndemo3-dev" -> null
-       instrumentation_key                   = (sensitive value) -> null
-       internet_ingestion_enabled            = true -> null
-       internet_query_enabled                = true -> null
-       local_authentication_disabled         = false -> null
-       location                              = "northeurope" -> null
-       name                                  = "logging-function-johndemo3-dev-johndemo3-dev" -> null
-       resource_group_name                   = "coop-demo3-rg-dev" -> null
-       retention_in_days                     = 30 -> null
-       sampling_percentage                   = 100 -> null
-       tags                                  = {
-           "repo_name" = "johndemo3"
        } -> null
#        (1 unchanged attribute hidden)
    }

  # module.function.azurerm_function_app.ml_model will be destroyed
  # (because azurerm_function_app.ml_model is not in configuration)
-   resource "azurerm_function_app" "ml_model" {
-       app_service_plan_id             = "/subscriptions/bd4b7a52-3576-4e08-81b6-fdbe7146cb7f/resourceGroups/coop-demo3-rg-dev/providers/Microsoft.Web/serverFarms/function_service_plan-johndemo3-dev" -> null
-       app_settings                    = {} -> null
-       custom_domain_verification_id   = "0DE963C0380AE3AAFCC07FDB3C0587E209EB6CA79D553E5E8D9203D3A7387E37" -> null
-       daily_memory_time_quota         = 0 -> null
-       default_hostname                = "function-johndemo3-dev.azurewebsites.net" -> null
-       enable_builtin_logging          = true -> null
-       enabled                         = true -> null
-       https_only                      = false -> null
-       id                              = "/subscriptions/bd4b7a52-3576-4e08-81b6-fdbe7146cb7f/resourceGroups/coop-demo3-rg-dev/providers/Microsoft.Web/sites/function-johndemo3-dev" -> null
-       key_vault_reference_identity_id = "SystemAssigned" -> null
-       kind                            = "functionapp,linux" -> null
-       location                        = "northeurope" -> null
-       name                            = "function-johndemo3-dev" -> null
-       os_type                         = "linux" -> null
-       outbound_ip_addresses           = "13.74.252.68,13.74.248.236,13.74.158.85,13.74.252.234,13.74.252.44" -> null
-       possible_outbound_ip_addresses  = "13.74.252.68,13.74.248.236,13.74.158.85,13.74.252.234,52.138.180.227,104.41.221.5,4.231.128.76,4.231.128.101,4.231.128.151,4.231.128.193,4.231.128.203,4.231.128.209,4.231.144.147,4.231.144.206,4.231.144.252,4.231.144.253,4.231.144.254,4.231.144.255,13.74.252.44" -> null
-       resource_group_name             = "coop-demo3-rg-dev" -> null
-       site_credential                 = [
-           {
-               password = "eqil4rq6K9wmAM09cwHF32KudijMXhPwv9J6SkuA7DSonCBaecFFCWvBpZlP"
-               username = "$function-johndemo3-dev"
            },
        ] -> null
-       storage_account_access_key      = (sensitive value) -> null
-       storage_account_name            = "johndemo3dev" -> null
-       tags                            = {
-           "repo_name" = "johndemo3"
        } -> null
-       version                         = "~3" -> null
#        (1 unchanged attribute hidden)

-       auth_settings {
-           additional_login_params        = {} -> null
-           allowed_external_redirect_urls = [] -> null
-           enabled                        = false -> null
-           token_refresh_extension_hours  = 0 -> null
-           token_store_enabled            = false -> null
#            (4 unchanged attributes hidden)
        }

-       site_config {
-           always_on                        = false -> null
-           app_scale_limit                  = 200 -> null
-           dotnet_framework_version         = "v4.0" -> null
-           elastic_instance_minimum         = 0 -> null
-           ftps_state                       = "FtpsOnly" -> null
-           http2_enabled                    = false -> null
-           ip_restriction                   = [] -> null
-           min_tls_version                  = "1.2" -> null
-           pre_warmed_instance_count        = 0 -> null
-           runtime_scale_monitoring_enabled = false -> null
-           scm_ip_restriction               = [] -> null
-           scm_type                         = "None" -> null
-           scm_use_main_ip_restriction      = false -> null
-           use_32_bit_worker_process        = false -> null
-           vnet_route_all_enabled           = false -> null
-           websockets_enabled               = false -> null
#            (4 unchanged attributes hidden)
        }

-       source_control {
-           branch             = "main" -> null
-           manual_integration = false -> null
-           rollback_enabled   = false -> null
-           use_mercurial      = false -> null
#            (1 unchanged attribute hidden)
        }
    }

  # module.function.azurerm_service_plan.func_service_plan will be destroyed
  # (because azurerm_service_plan.func_service_plan is not in configuration)
-   resource "azurerm_service_plan" "func_service_plan" {
-       id                           = "/subscriptions/bd4b7a52-3576-4e08-81b6-fdbe7146cb7f/resourceGroups/coop-demo3-rg-dev/providers/Microsoft.Web/serverFarms/function_service_plan-johndemo3-dev" -> null
-       kind                         = "functionapp" -> null
-       location                     = "northeurope" -> null
-       maximum_elastic_worker_count = 1 -> null
-       name                         = "function_service_plan-johndemo3-dev" -> null
-       os_type                      = "Linux" -> null
-       per_site_scaling_enabled     = false -> null
-       reserved                     = true -> null
-       resource_group_name          = "coop-demo3-rg-dev" -> null
-       sku_name                     = "Y1" -> null
-       tags                         = {} -> null
-       worker_count                 = 0 -> null
-       zone_balancing_enabled       = false -> null
#        (1 unchanged attribute hidden)
    }

  # module.service_bus.azurerm_servicebus_namespace.image_inputs will be created
+   resource "azurerm_servicebus_namespace" "image_inputs" {
+       capacity                            = 0
+       default_primary_connection_string   = (sensitive value)
+       default_primary_key                 = (sensitive value)
+       default_secondary_connection_string = (sensitive value)
+       default_secondary_key               = (sensitive value)
+       endpoint                            = (known after apply)
+       id                                  = (known after apply)
+       local_auth_enabled                  = true
+       location                            = "northeurope"
+       minimum_tls_version                 = "1.2"
+       name                                = "johndemo3-servicebus-namespace-dev"
+       premium_messaging_partitions        = 0
+       public_network_access_enabled       = true
+       resource_group_name                 = "coop-demo3-rg-dev"
+       sku                                 = "Standard"
+       tags                                = {
+           "environment" = "dev"
        }

+       network_rule_set (known after apply)
    }

  # module.service_bus.azurerm_servicebus_queue.image_inputs will be created
+   resource "azurerm_servicebus_queue" "image_inputs" {
+       auto_delete_on_idle                     = "**************************"
+       batched_operations_enabled              = true
+       dead_lettering_on_message_expiration    = false
+       default_message_ttl                     = "P10675199DT2H48M5.4775807S"
+       duplicate_detection_history_time_window = "PT10M"
+       express_enabled                         = false
+       id                                      = (known after apply)
+       lock_duration                           = "PT1M"
+       max_delivery_count                      = 10
+       max_message_size_in_kilobytes           = (known after apply)
+       max_size_in_megabytes                   = (known after apply)
+       name                                    = "johndemo3_queue_dev"
+       namespace_id                            = (known after apply)
+       partitioning_enabled                    = false
+       requires_duplicate_detection            = false
+       requires_session                        = false
+       status                                  = "Active"
    }

  # module.storage_account.azurerm_storage_container.image_prediction_output will be created
+   resource "azurerm_storage_container" "image_prediction_output" {
+       container_access_type             = "private"
+       default_encryption_scope          = (known after apply)
+       encryption_scope_override_enabled = true
+       has_immutability_policy           = (known after apply)
+       has_legal_hold                    = (known after apply)
+       id                                = (known after apply)
+       metadata                          = (known after apply)
+       name                              = "johndemo3-image-prediction-output-container-dev"
+       resource_manager_id               = (known after apply)
+       storage_account_name              = "johndemo3dev"
    }

Plan: 3 to add, 0 to change, 4 to destroy.

Changes to Outputs:
+   service_bus_queue_name = "johndemo3_queue_dev"
```
</details>

:memo: Plan generated in [PR Plan #12](https://github.com/JunzhongLin/johndemo3/actions/runs/13034648865)